### SQL in 10 Minutes
#### Lesson VIII
`CREATE TABLE`, `ALTER TABLE`, `VIEW`, `CONSTRAINT`

In [1]:
import sqlite3
import pandas as pd

In [2]:
db = 'tysql.sqlite'
conn = sqlite3.connect(db)

In [3]:
tables = pd.read_sql("""SELECT * FROM sqlite_master WHERE type = 'table';""", conn)
tables

,type,name,tbl_name,rootpage,sql
0,table,Customers,Customers,2,CREATE TABLE Customers\n(\n cust_id char...
1,table,OrderItems,OrderItems,4,CREATE TABLE OrderItems\n(\n order_num int ...
2,table,Orders,Orders,7,CREATE TABLE Orders\n(\n order_num int ...
3,table,Products,Products,10,CREATE TABLE Products\n(\n prod_id char(10...
4,table,Vendors,Vendors,12,CREATE TABLE Vendors\n(\n vend_id char(1...

In [4]:
sql = """
        create table PPD
        ( 
          prod_id            CHAR(10)                 NOT NULL,
          vend_id            CHAR(10)                 NOT NULL,
          prod_name       CHAR(254)               NOT NULL,
          prod_price        DECIMAL(8, 2)          NOT NULL,
          prod_desc        VARCHAR(1000)        NULL
        );
        """

In [5]:
cur = conn.cursor()
cur.execute(sql)

In [6]:
conn.commit()

See if it works correctly:

In [7]:
ex1 = pd.read_sql("""select * from PPD""", conn)
ex1

Empty DataFrame
Columns: [prod_id, vend_id, prod_name, prod_price, prod_desc]
Index: []

In [8]:
tables = pd.read_sql("""SELECT * FROM sqlite_master WHERE type = 'table';""", conn)
tables

,type,name,tbl_name,rootpage,sql
0,table,Customers,Customers,2,CREATE TABLE Customers\n(\n cust_id char...
1,table,OrderItems,OrderItems,4,CREATE TABLE OrderItems\n(\n order_num int ...
2,table,Orders,Orders,7,CREATE TABLE Orders\n(\n order_num int ...
3,table,Products,Products,10,CREATE TABLE Products\n(\n prod_id char(10...
4,table,Vendors,Vendors,12,CREATE TABLE Vendors\n(\n vend_id char(1...
5,table,PPD,PPD,15,CREATE TABLE PPD\n ( \n prod_i...

In [9]:
sql = """
        create table ORD
        ( 
          order_num        INTEGER                 NOT NULL,
          order_date        DATETIME               NOT NULL,
          cust_id             CHAR(10)                 NOT NULL
        );
        """

In [10]:
cur = conn.cursor()
cur.execute(sql)
conn.commit()

In [11]:
ex2 = pd.read_sql("""select * from ORD""", conn)
ex2

Empty DataFrame
Columns: [order_num, order_date, cust_id]
Index: []

Mixing `NULL` & `NOT NULL`

In [18]:
sql = """
        create table VEND
        ( 
          vend_id            CHAR(10)                 NOT NULL,
          vend_name       CHAR(50)                NOT NULL,
          vend_address    CHAR(50)                       NULL,
          vend_city          CHAR(50)                       NULL,
          vend_state        CHAR(5)                         NULL,
          vend_zip           CHAR(10)                        NULL,
          vend_country    CHAR(50)                        NULL
        );
        """

In [19]:
cur = conn.cursor()
cur.execute(sql)
conn.commit()

In [20]:
ex3 = pd.read_sql("""select * from VEND""", conn)
ex3

Empty DataFrame
Columns: [vend_id, vend_name, vend_address, vend_city, vend_state, vend_zip, vend_country]
Index: []

`ALTER TABLE`

add columns

In [21]:
sql = """
        alter table VEND
        add vend_phone   CHAR(20);
        """

In [22]:
cur = conn.cursor()
cur.execute(sql)
conn.commit()

In [23]:
ex4 = pd.read_sql("""select * from VEND""", conn)
ex4

Empty DataFrame
Columns: [vend_id, vend_name, vend_address, vend_city, vend_state, vend_zip, vend_country, vend_phone]
Index: []

In [28]:
sql = """
        drop table VEND;
        """

In [29]:
cur = conn.cursor()
cur.execute(sql)
conn.commit()

In [30]:
ex5 = pd.read_sql("""SELECT * FROM sqlite_master WHERE type = 'table';""", conn)
ex5

,type,name,tbl_name,rootpage,sql
0,table,Customers,Customers,2,CREATE TABLE Customers\n(\n cust_id char...
1,table,OrderItems,OrderItems,4,CREATE TABLE OrderItems\n(\n order_num int ...
2,table,Orders,Orders,7,CREATE TABLE Orders\n(\n order_num int ...
3,table,Products,Products,10,CREATE TABLE Products\n(\n prod_id char(10...
4,table,Vendors,Vendors,12,CREATE TABLE Vendors\n(\n vend_id char(1...
5,table,PPD,PPD,15,CREATE TABLE PPD\n ( \n prod_i...
6,table,ORD,ORD,16,CREATE TABLE ORD\n ( \n order_...

View

In [31]:
sql = """
        select cust_name, cust_contact
        from Customers, Orders, OrderItems
        where Customers.cust_id = Orders.cust_id
        and OrderItems.order_num = Orders.order_num
        and prod_id = 'RGAN01';
        """

In [32]:
ex6 = pd.read_sql(sql, conn)
ex6

       cust_name        cust_contact
0        Fun4All  Denise L. Stephens
1  The Toy Store          Kim Howard

In [33]:
sql = """
        create view ProductCustomers as
        select cust_name, cust_contact, prod_id
        from Customers, Orders, OrderItems
        where Customers.cust_id = Orders.cust_id
        and OrderItems.order_num = Orders.order_num;
        """

In [34]:
cur = conn.cursor()
cur.execute(sql)
conn.commit()

In [35]:
ex7 = pd.read_sql("""SELECT * FROM ProductCustomers""", conn)
ex7

        cust_name        cust_contact prod_id
0    Village Toys          John Smith    BR01
1    Village Toys          John Smith    BR03
2         Fun4All           Jim Jones    BR01
3         Fun4All           Jim Jones    BR02
4         Fun4All           Jim Jones    BR03
5         Fun4All  Denise L. Stephens    BR03
6         Fun4All  Denise L. Stephens  BNBG01
7         Fun4All  Denise L. Stephens  BNBG02
8         Fun4All  Denise L. Stephens  BNBG03
9         Fun4All  Denise L. Stephens  RGAN01
10  The Toy Store          Kim Howard  RGAN01
11  The Toy Store          Kim Howard    BR03
12  The Toy Store          Kim Howard  BNBG01
13  The Toy Store          Kim Howard  BNBG02
14  The Toy Store          Kim Howard  BNBG03
15   Village Toys          John Smith  BNBG01
16   Village Toys          John Smith  BNBG02
17   Village Toys          John Smith  BNBG03

In [36]:
sql = """
        select cust_name, cust_contact
        from ProductCustomers
        where prod_id = 'RGAN01';
        """

In [37]:
ex8 = pd.read_sql(sql, conn)
ex8

       cust_name        cust_contact
0        Fun4All  Denise L. Stephens
1  The Toy Store          Kim Howard

In [38]:
sql = """
        select TRIM(vend_name) || ' (' || TRIM(vend_country) || ')'
        as vend_title
        from Vendors
        order by vend_name;
        """

some other sql platforms may use '+' instead of '||'

In [39]:
ex9 = pd.read_sql(sql, conn)
ex9

                vend_title
0      Bear Emporium (USA)
1         Bears R Us (USA)
2    Doll House Inc. (USA)
3  Fun and Games (England)
4       Furball Inc. (USA)
5  Jouets et ours (France)

In [42]:
sql = """
        create view VendorLocations as
        select TRIM(vend_name) || ' (' || TRIM(vend_country) || ')'
        as vend_title
        from Vendors;
        """

In [43]:
cur = conn.cursor()
cur.execute(sql)
conn.commit()

In [44]:
ex10 = pd.read_sql("""select * from VendorLocations;""", conn)
ex10

                vend_title
0         Bears R Us (USA)
1      Bear Emporium (USA)
2    Doll House Inc. (USA)
3       Furball Inc. (USA)
4  Fun and Games (England)
5  Jouets et ours (France)

In [45]:
sql = """
        create view CustomerEmailList as
        select cust_id, cust_name, cust_email
        from Customers
        where cust_email is not NULL;
        """

In [46]:
cur = conn.cursor()
cur.execute(sql)
conn.commit()

In [47]:
ex11 = pd.read_sql("""select * from CustomerEmailList;""", conn)
ex11

      cust_id     cust_name             cust_email
0  1000000001  Village Toys  sales@villagetoys.com
1  1000000003       Fun4All     jjones@fun4all.com
2  1000000004       Fun4All  dstephens@fun4all.com

View with Calculation

In [48]:
sql = """
        select prod_id, quantity, item_price, quantity * item_price as expanded_price
        from OrderItems
        where order_num = 20008;
        """

In [49]:
ex12 = pd.read_sql(sql, conn)
ex12

  prod_id  quantity  item_price  expanded_price
0  RGAN01         5        4.99           24.95
1    BR03         5       11.99           59.95
2  BNBG01        10        3.49           34.90
3  BNBG02        10        3.49           34.90
4  BNBG03        10        3.49           34.90

In [50]:
sql = """
        create view OrderItemsExpanded as
        select order_num, prod_id, quantity, item_price, quantity * item_price as expanded_price
        from OrderItems;
        """

In [51]:
cur = conn.cursor()
cur.execute(sql)
conn.commit()

In [52]:
ex13 = pd.read_sql("""select * from OrderItemsExpanded where order_num = 20008;""", conn)
ex13

   order_num prod_id  quantity  item_price  expanded_price
0      20008  RGAN01         5        4.99           24.95
1      20008    BR03         5       11.99           59.95
2      20008  BNBG01        10        3.49           34.90
3      20008  BNBG02        10        3.49           34.90
4      20008  BNBG03        10        3.49           34.90

`SAVING` is not covered in this series of operations based on SQLite.

`transaction processing`

`TRANSACTION`: a group of sql languages;

`ROLLBACK`: cancel the given sql languages;

`COMMIT`: write the sql language in the database;

`SAVEPOINT`: temperory placeholder.

`CURSOR`

`Constraint`: manage rules for database.

`PRIMARY KEY`

In [56]:
sql = """
        create table VENDNEW
        ( 
          vend_id            CHAR(10)                 NOT NULL              PRIMARY KEY,
          vend_name       CHAR(50)                NOT NULL,
          vend_address    CHAR(50)                       NULL,
          vend_city          CHAR(50)                       NULL,
          vend_state        CHAR(5)                         NULL,
          vend_zip           CHAR(10)                        NULL,
          vend_country    CHAR(50)                        NULL
        );
        """

In [57]:
cur = conn.cursor()
cur.execute(sql)
conn.commit()

In [58]:
ex14 = pd.read_sql("""select * from VENDNEW;""", conn)
ex14

Empty DataFrame
Columns: [vend_id, vend_name, vend_address, vend_city, vend_state, vend_zip, vend_country]
Index: []

`REFERENCES`

In [59]:
sql = """
        create table ORDNEW
        ( 
          order_num        INTEGER                 NOT NULL              PRIMARY KEY,
          order_date        DATETIME               NOT NULL,
          cust_id             CHAR(10)                 NOT NULL             REFERENCES Customers(cust_id)
        );
        """

In [60]:
cur = conn.cursor()
cur.execute(sql)
conn.commit()

In [61]:
ex15 = pd.read_sql("""select * from ORDNEW;""", conn)
ex15

Empty DataFrame
Columns: [order_num, order_date, cust_id]
Index: []

`CHECK`

In [62]:
sql = """
        create table ORDIT
        ( 
          order_num        INTEGER                 NOT NULL,
          order_item        INTEGER                 NOT NULL,
          prod_id             CHAR(10)                NOT NULL,
          quantity            INTEGER                 NOT NULL            CHECK (quantity > 0),
          item_price         MONEY                   NOT NULL
        );
        """

In [63]:
cur = conn.cursor()
cur.execute(sql)
conn.commit()

In [64]:
ex16 = pd.read_sql("""select * from ORDIT;""", conn)
ex16

Empty DataFrame
Columns: [order_num, order_item, prod_id, quantity, item_price]
Index: []

`INDEX`

In [3]:
sql = """
        create index prod_name_ind
        on Products (prod_name);
        """

In [4]:
cur = conn.cursor()
cur.execute(sql)
conn.commit()

In [5]:
sql = """
        explain query plan
        select * 
        from Products
        """

In [6]:
ex17 = pd.read_sql(sql, conn)
ex17

   id  parent  notused               detail
0   2       0        0  SCAN TABLE Products

In [10]:
sql = """
        explain query plan
        select prod_name, prod_price, prod_desc
        from Products
        where prod_id = 'BR03'; 
        """

In [11]:
ex18 = pd.read_sql(sql, conn)
ex18

   id  parent  notused                                             detail
0   3       0        0  SEARCH TABLE Products USING INDEX sqlite_autoi...